---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.MomentOfInertia
source: html/18e800fd-1904-969e-0d07-e7e60f83ef07.htm
---
# Autodesk.Revit.DB.SpecTypeId.MomentOfInertia Property

Moment of Inertia, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId MomentOfInertia { get; }
```